{
  "code": 200,
  "message": "Data retrieved successfully",
  "data": [
    {
      "id": 1,
      "name": "Laravel CRUD",
      "created_at": "2024-08-21T13:37:06Z",
      "updated_at": "2024-09-24T09:32:55Z",
      "image": null,
      "description": {
        "summary": "The foundation of a CRUD website built using the Laravel framework.",
        "detail": [
          "The project is a CRUD (Create, Read, Update, Delete) based web application built using PHP Laravel, a powerful and efficient PHP framework. The app is designed to make it easier for users to manage their data through a simple and intuitive web interface.",
          "I created this project to test my ability to use the PHP programming language and the Laravel framework"
        ]
      },
      "category": "Full-stack",
      "tags": ["PHP", "Laravel", "TailwindCSS", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Can create, read, update and delete data",
            "If user don't use an image, it automatically uses the default image"
          ]
        }
      ],
      "homepage": null,
      "git": "https://github.com/ryzmdn/laravel-crud",
      "license": "CC0-1.0",
      "contributors": null
    },
    {
      "id": 2,
      "name": "Payment Form",
      "created_at": "2024-10-08T07:22:46Z",
      "updated_at": "2025-02-15T01:58:22Z",
      "image": null,
      "description": {
        "summary": "A simple payment form built using React, Vite, and Tailwind CSS.",
        "detail": [
          "A simple payment form built using React, Vite, and Tailwind CSS. This form is divided into two sections: the payment method section and the personal information section. The project is created for fun and does not involve handling any actual personal data."
        ]
      },
      "category": "Front-end",
      "tags": [
        "React.js",
        "TailwindCSS",
        "HTML",
        "CSS",
        "JavaScript",
        "Website"
      ],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Responsive layout",
            "Built with React and Vite for fast development",
            "Payment methods section",
            "Personal information section",
            "Input validation",
            "Fun and experimental project (no real data handling)"
          ]
        }
      ],
      "homepage": "https://payment-form-beta.netlify.app",
      "git": "https://github.com/ryzmdn/payment-form",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 3,
      "name": "QR Code Generator",
      "created_at": "2024-09-28T04:26:53Z",
      "updated_at": "2024-10-20T02:13:15Z",
      "image": null,
      "description": {
        "summary": "QR code generator with clean and simple open-source code.",
        "detail": [
          "The QR code generator created using HTML, CSS, and JavaScript is a web application that allows users to generate QR codes dynamically directly from their browser. The generated QR codes can contain various types of data, such as text, URLs, contacts, locations, and more."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Working link",
            "Can be scanned",
            "Can be reused for your website"
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/qrcode-generator",
      "git": "https://github.com/ryzmdn/qrcode-generator",
      "license": null,
      "contributors": null
    },
    {
      "id": 4,
      "name": "BMI Calculator",
      "created_at": "2024-09-28T14:37:33Z",
      "updated_at": "2024-10-20T02:14:06Z",
      "image": null,
      "description": {
        "summary": "This BMI calculator is a simple web application designed to help users calculate their body mass index.",
        "detail": [
          "The Body Mass Index (BMI) Calculator can be used to calculate BMI value and corresponding weight status while taking age into consideration. Use the \"Metric Units\" tab for the International System of Units or the \"Other Units\" tab to convert units into either US or metric units.",
          "Note: that the calculator also computes the Ponderal Index in addition to BMI, both of which are discussed below in detail."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": ["Status check with color", "Advice message", "Working chart"]
        }
      ],
      "homepage": "https://ryzmdn.github.io/bmi-calculator",
      "git": "https://github.com/ryzmdn/bmi-calculator",
      "license": null,
      "contributors": null
    },
    {
      "id": 5,
      "name": "JavaScript Dynamic Calendar",
      "created_at": "2024-09-29T02:44:13Z",
      "updated_at": "2024-10-20T02:13:45Z",
      "image": null,
      "description": {
        "summary": "Dynamic calendar is an interactive element on a web page that displays dates for a specific month or time range.",
        "detail": [
          "A dynamic calendar is an interactive element on a web page that displays dates for a specific month or time range. This calendar is created using HTML, CSS, and javascript with a minimalist User Interface design for easy readability. There are 12 calendars from January to December, corresponding to the number of months in a year."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Automatic date marker",
            "Automatically generate dates in each month",
            "Can generate dates in different years"
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/dynamic-calendar",
      "git": "https://github.com/ryzmdn/dynamic-calendar",
      "license": null,
      "contributors": null
    },
    {
      "id": 6,
      "name": "Node.js Mailer",
      "created_at": "2024-11-08T12:51:01Z",
      "updated_at": "2024-11-08T12:56:46Z",
      "image": null,
      "description": {
        "summary": "Nodemailer to send messages with a form from the sender's email to the recipient's email using Node.js",
        "detail": [
          "Nodemailer is a module for Node.js applications that allows easy email sending. The project started in 2010 when there were few reliable options for sending email messages, and today, it is the default solution for most Node.js users."
        ]
      },
      "category": "Back-end",
      "tags": ["Node.js", "Express.js", "JavaScript", "Website"],
      "features": null,
      "homepage": null,
      "git": "https://github.com/ryzmdn/nodejs-mailer",
      "license": null,
      "contributors": null
    },
    {
      "id": 7,
      "name": "Node.js URL Shortener",
      "created_at": "2024-11-10T23:40:44Z",
      "updated_at": "2024-11-10T23:44:53Z",
      "image": null,
      "description": {
        "summary": "Create a short URL for a long train using Node.js.",
        "detail": [
          "A URL shortener makes a URL shorter for you. Long URLs can be hard to remember or share with others. A shortened URL version makes it easier to share your favorite link.",
          "This project also help in other ways. For instance, links shortened with the same tool look very similar, especially for the domain part. This makes the URL seem more authentic."
        ]
      },
      "category": "Back-end",
      "tags": ["Node.js", "Express.js", "JavaScript", "Website"],
      "features": null,
      "homepage": null,
      "git": "https://github.com/ryzmdn/nodejs-url-shortener",
      "license": null,
      "contributors": null
    },
    {
      "id": 8,
      "name": "Tribute Page",
      "created_at": "2024-11-12T03:21:52Z",
      "updated_at": "2025-02-15T01:54:34Z",
      "image": null,
      "description": {
        "summary": "A tribute page about a figure I admire.",
        "detail": [
          "A simple tribute page developed using React and Tailwind CSS. This project aims to pay homage to a specific figure or theme through a responsive, modern, and interactive design. It's suitable for beginners as practice in using the React framework and styling with Tailwind CSS."
        ]
      },
      "category": "Front-end",
      "tags": ["React.js", "TailwindCSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Using Tailwind CSS to ensure the page looks good on various screen sizes.",
            "Built with separate React components for easy maintenance.",
            "Designed with accessibility in mind to be usable by all users.",
            "Easy to change images, text, and tribute themes."
          ]
        }
      ],
      "homepage": "https://tribute-page-einstein.netlify.app",
      "git": "https://github.com/ryzmdn/tribute-page",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 9,
      "name": "Link Bio",
      "created_at": "2024-11-14T07:51:26Z",
      "updated_at": "2025-02-14T18:00:41Z",
      "image": null,
      "description": {
        "summary": "A one-page minimalist web link bio",
        "detail": [
          "This project is a simple website developed using Vue, Vite, and Tailwind CSS. The goal of this project is to provide social media links and e-commerce products that can be placed in social media bios through a responsive, modern, and interactive design. It's suitable for beginners as practice in using the React framework and styling with Tailwind CSS."
        ]
      },
      "category": "Front-end",
      "tags": ["Vue.js", "TailwindCSS", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Using Tailwind CSS to make sure the page looks good on various screen sizes.",
            "Built with separate React components for easier maintenance.",
            "Designed with accessibility in mind to be usable by all users.",
            "Customizable: Easy to change images, text, and theme."
          ]
        }
      ],
      "homepage": "https://linkbio-johndoe.netlify.app",
      "git": "https://github.com/ryzmdn/link-bio",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 10,
      "name": "Stopwatch",
      "created_at": "2024-11-28T16:05:25Z",
      "updated_at": "2024-11-28T16:08:55Z",
      "image": null,
      "description": {
        "summary": "A simple stopwatch with pause, checkpoint, and reset features using queue programming algorithm.",
        "detail": [
          "The Stopwatch is a web-based application built with HTML, CSS, and JavaScript. It provides an interactive and visually appealing way to measure elapsed time. The application employs a queue algorithm to manage and process user actions efficiently."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Start and stop the timer with ease using intuitive controls.",
            "Record multiple lap times during a single session.",
            "Reset the stopwatch to start a new session.",
            "Fully responsive UI for seamless use on desktop and mobile devices.",
            "Implements a queue algorithm to ensure accurate processing of start, stop, and lap actions."
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/stopwatch",
      "git": "https://github.com/ryzmdn/stopwatch",
      "license": null,
      "contributors": null
    },
    {
      "id": 11,
      "name": "Resume",
      "created_at": "2024-12-05T06:22:27Z",
      "updated_at": "2025-02-15T02:10:18Z",
      "image": null,
      "description": {
        "summary": "A responsive web-based Resume built using React, Vite, TypeScript, and Tailwind CSS.",
        "detail": [
          "A responsive web-based Resume built using React, Vite, TypeScript, and Tailwind CSS. This project provides a sleek and modern Resume layout that works seamlessly across different device sizes, from small mobile screens to large desktops."
        ]
      },
      "category": "Front-end",
      "tags": ["React.js", "TailwindCSS", "TypeScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Responsive Design: Optimized for both small and large screens.",
            "Modern Tech Stack: Built with React, Vite, TypeScript, and Tailwind CSS for fast development and styling.",
            "Interactive Layout: Smooth transitions and an intuitive interface.",
            "Customizable: Easily modify the content and styles to match your personal branding.",
            "Fast Loading: Leverages Vite for efficient development and deployment."
          ]
        }
      ],
      "homepage": "https://resume-brooklyn.netlify.app/",
      "git": "https://github.com/ryzmdn/resume",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 12,
      "name": "Curriculum Vitae",
      "created_at": "2024-12-07T01:27:52Z",
      "updated_at": "2025-02-14T17:54:43Z",
      "image": null,
      "description": {
        "summary": "A responsive web-based Curriculum Vitae (CV) built using React, Vite, TypeScript, and Tailwind CSS.",
        "detail": [
          "A responsive web-based Curriculum Vitae (CV) built using React, Vite, TypeScript, and Tailwind CSS. This project provides a sleek and modern CV layout that works seamlessly across different device sizes, from small mobile screens to large desktops."
        ]
      },
      "category": "Front-end",
      "tags": ["React.js", "TailwindCSS", "TypeScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Optimized for both small and large screens.",
            "Built with React, Vite, TypeScript, and Tailwind CSS for fast development and styling.",
            "Smooth transitions and an intuitive interface.",
            "Easily modify the content and styles to match your personal branding.",
            "Leverages Vite for efficient development and deployment."
          ]
        }
      ],
      "homepage": "https://curriculum-vitae-devonwebb.netlify.app",
      "git": "https://github.com/ryzmdn/curriculum-vitae",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 13,
      "name": "Digital Clock",
      "created_at": "2024-12-12T15:05:08Z",
      "updated_at": "2024-12-12T15:09:48Z",
      "image": null,
      "description": {
        "summary": "The Digital Clock is a web-based application built with HTML, CSS, and JavaScript.",
        "detail": [
          "The Digital Clock is a web-based application built with HTML, CSS, and JavaScript. It displays real-time dynamic information such as the current time (hours, minutes, and seconds), AM/PM status, date, month, year, and simulated environmental data like fake temperature and humidity."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Shows current hours, minutes, and seconds, updated in real time.",
            "Displays whether the current time is AM or PM.",
            "Provides the current date, month, and year.",
            "Simulates and displays environmental data for a fun and interactive experience.",
            "Optimized for seamless use across desktop and mobile devices.",
            "Styled with CSS to deliver a clean and modern look."
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/digital-clock/",
      "git": "https://github.com/ryzmdn/digital-clock",
      "license": null,
      "contributors": null
    },
    {
      "id": 14,
      "name": "Weather Forecast",
      "created_at": "2024-12-18T12:27:28Z",
      "updated_at": "2025-02-15T02:15:14Z",
      "image": null,
      "description": {
        "summary": "A modern Weather Forecast application built with Next.js, Tailwind CSS, and the OpenWeatherMap API.",
        "detail": [
          "A modern Weather Forecast application built with Next.js, Tailwind CSS, and the OpenWeatherMap API. This project provides accurate and detailed weather forecasts, Search for cities with accurate names like the original. including a calendar view for planning ahead. It features a sleek and responsive design optimized for all device sizes, ensuring a seamless user experience."
        ]
      },
      "category": "Front-end",
      "tags": ["Next.js", "TailwindCSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "View accurate weather predictions for the week ahead.",
            "Intuitive and easy-to-navigate calendar interface for checking forecasts by date.",
            "Optimized for mobile, tablet, and desktop devices.",
            "Fetches up-to-date weather information from the OpenWeatherMap API.",
            "The background color changes every 6 times (Dawn, Morning, Noon, Afternoon, Evening and Night) and rainy weather.",
            "Built using Next.js for server-side rendering and Tailwind CSS for streamlined styling.",
            "Easily adapt the design and features to suit your needs."
          ]
        }
      ],
      "homepage": "https://weather-forecast-rosy-zeta.vercel.app/",
      "git": "https://github.com/ryzmdn/weather-forecast",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 15,
      "name": "Markdown Previewer",
      "created_at": "2025-01-01T15:37:54Z",
      "updated_at": "2025-02-15T01:50:23Z",
      "image": null,
      "description": {
        "summary": "A sleek and modern Markdown Previewer application built using Vite, Vue, and SCSS.",
        "detail": [
          "A sleek and modern Markdown Previewer application built using Vite, Vue, and SCSS. This project provides a real-time markdown editing and preview experience, perfect for writers, developers, and anyone working with markdown."
        ]
      },
      "category": "Front-end",
      "tags": ["Vue.js", "JavaScript", "HTML", "SCSS", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "See changes in your markdown reflected instantly in the preview pane.",
            "Built with SCSS for easy customization of themes and layouts.",
            "Full support for GitHub-flavored markdown, including tables, code blocks, and inline formatting.",
            "Optimized for mobile, tablet, and desktop devices.",
            "Powered by Vite for blazing-fast development and build processes.",
            "Add custom markdown plugins or extend functionality to suit your workflow."
          ]
        }
      ],
      "homepage": "https://markdown-previewer-beta.netlify.app/",
      "git": "https://github.com/ryzmdn/markdown-previewer",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 16,
      "name": "Sign in and Registration Page",
      "created_at": "2025-01-06T18:16:28Z",
      "updated_at": "2025-02-15T02:22:42Z",
      "image": null,
      "description": {
        "summary": "A modern Registration Page app built with React.js, Vite, and Tailwind CSS.",
        "detail": [
          "A modern Registration Page app built with React.js, Vite, and Tailwind CSS. This project provides a seamless user registration experience with a simple and intuitive design. It includes both Login and Register pages, making it ideal for integrating into larger web applications.."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "React.js", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Enables users to sign up and log in securely.",
            "Separate Login and Register pages for a clean user experience.",
            "Fully optimized for desktop, tablet, and mobile devices.",
            "Built using React.js with fast development using Vite and modern styling with Tailwind CSS.",
            "Easily adaptable to fit different project requirements and branding."
          ]
        }
      ],
      "homepage": "https://registration-page-beta.netlify.app",
      "git": "https://github.com/ryzmdn/registration-page",
      "license": null,
      "contributors": null
    },
    {
      "id": 17,
      "name": "Library Management System",
      "created_at": "2025-01-06T18:16:28Z",
      "updated_at": "2025-02-15T02:22:42Z",
      "image": null,
      "description": {
        "summary": "The Library Management System is a console-based app made using C#.",
        "detail": [
          "The Library Management System is a console-based application made using C#. It's designed to help manage a library with Linked List algorithms and features like adding books, members, borrowing and returning books, and displaying lists of books, members, and loans."
        ]
      },
      "category": "Back-end",
      "tags": ["C#", ".NET", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Add new book info to the system.",
            "Add a new member to the system.",
            "Borrow books from the library.",
            "Return the books you've borrowed.",
            "Show the list of all available books in the library.",
            "Show the list of all library members.",
            "Show the list of all ongoing book loans.",
            "Exit the program."
          ]
        }
      ],
      "homepage": null,
      "git": "https://github.com/ryzmdn/library-management-system",
      "license": null,
      "contributors": null
    },
    {
      "id": 18,
      "name": "RyzDev",
      "created_at": "2025-02-24T13:59:53Z",
      "updated_at": "2025-04-17T02:43:44Z",
      "image": null,
      "description": {
        "summary": "Discover My journey through projects full of ideas, challenges, and inspiration. From simple to complex works, everything is here to see and appreciate.",
        "detail": [
          "RyzDev (Ryzmdn Development) is the place where all of my creative journeys are documented. This website contains a comprehensive list of projects I have worked on, from the initial idea to the final result.",
          "Ryzmdn is the username of some of my social media accounts. The main goal of RyzDev is to share my achievements with the world, inspire others, and prove that every small step in the journey can lead to something extraordinary. Here, you will find a wide variety of projects that cover a wide range of fields and show my dedication and passion for continuous improvement."
        ]
      },
      "category": "Front-end",
      "tags": ["React.js", "TypeScript", "TailwindCSS", "Website"],
      "features": [
        {
          "version": "1.8.4",
          "list": [
            "Added new section: contributors",
            "Added a special section for project features",
            "Added select to view project versions and features",
            "Content visibility adjustments",
            "Changelog page is now unavailable",
            "Fix missing release date on desktop devices",
            "Customization of user interface style"
          ]
        },
        {
          "version": "1.5.2",
          "list": [
            "Add new option: Android",
            "Customize project link styles",
            "Adjust transitions",
            "Fix date color blending with background color"
          ]
        },
        {
          "version": "1.4.8",
          "list": [
            "Optimize image loading to be faster",
            "Customize icons and text in each project",
            "Update dependencies and lib versions to newer",
            "Optimize components for the better",
            "Adjust text size and layout for the better"
          ]
        },
        {
          "version": "1.0.0",
          "list": [
            "Addition of an \"About Me\" page that tells the story of my journey as a creator is now available.",
            "Optimize code and images to speed up page load times.",
            "Added a dark theme option for the user's convenience when wanting to change the web theme to light or dark.",
            "Projects can be grouped by categories, such as \"Front-end\", \"Back-end\", \"Full-stack\" and others, to make it easier to explore.",
            "A cleaner, more responsive, and easy-to-navigate web display on all devices.",
            "Optimize code for images, svg and time by applying best practices to speed up page load times.",
            "Added error handling when the web or content encountered an unknown issue.",
            "SEO optimization gets better for the web to appear on search engines."
          ]
        }
      ],
      "homepage": "https://ryzdev.vercel.app",
      "git": "https://github.com/ryzdevs/ryzdev",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 19,
      "name": "PDF Downloader",
      "created_at": "2025-02-08T16:11:14Z",
      "updated_at": "2025-02-08T16:19:35Z",
      "image": null,
      "description": {
        "summary": "PDF downloader created using HTML, CSS, JavaScript and PHP.",
        "detail": [
          "This is the same project created to test my ability to use the PHP programming language. The project uses html, css and javascript as the front end and php as the back-end."
        ]
      },
      "category": "Full-stack",
      "tags": ["HTML", "CSS", "JavaScript", "PHP", "Website"],
      "features": null,
      "homepage": null,
      "git": "https://github.com/ryzmdn/pdf-downloader",
      "license": null,
      "contributors": null
    },
    {
      "id": 20,
      "name": "MDX Webcontent",
      "created_at": "2025-02-11T14:23:18Z",
      "updated_at": "2025-02-11T14:24:37Z",
      "image": null,
      "description": {
        "summary": "All text here is created in the MDX extension with Next.js for rendering.",
        "detail": [
          "MDX WebContent is a boilerplate designed to make it easier to create and manage MDX-based content with Next.js and Tailwind CSS. The project allows you to write content in MDX format, which is then rendered with Next.js for a fast and modern user experience."
        ]
      },
      "category": "Front-end",
      "tags": ["Next.js", "JavaScript", "MDX", "TailwindCSS", "Website"],
      "features": null,
      "homepage": null,
      "git": "https://github.com/ryzmdn/mdx-webcontent",
      "license": null,
      "contributors": null
    },
    {
      "id": 21,
      "name": "RyzBook",
      "created_at": "2025-02-24T14:00:45Z",
      "updated_at": "2025-04-17T13:22:34Z",
      "image": null,
      "description": {
        "summary": "RyzBook is a simple and open guestbook web application where visitors can leave messages without the need to log in or create an account.",
        "detail": [
          "RyzBook (Ryzmdn Guest Book) is a simple and open guestbook web application where visitors can leave messages without needing to log in or create an account. Everyone can see all messages on this website, they can also send any message once every hour in real-time.",
          "This project has an appearance theme of \"Neumorphism\" which is a design style used in graphical user interfaces. usually identified by a soft, light look with elements that appear to stand out or recess into the background rather than hovering above it."
        ]
      },
      "category": "Full-stack",
      "tags": [
        "React.js",
        "Vite",
        "JavaScript",
        "Tailwind CSS",
        "Firebase",
        "Website"
      ],
      "features": [
        {
          "version": "2.5.5",
          "list": [
            "Action section layout adjustment",
            "User interface color customization",
            "Sidebar style update",
            "Add click to overlay when sidebar is active",
            "Component bug fixes",
            "Transition adjustments",
            "Content visibility adjustments"
          ]
        },
        {
          "version": "2.0.0",
          "list": [
            "Updated the overall theme",
            "Add light and dark themes",
            "Customize SEO",
            "Customize the transition utility",
            "Customize button components",
            "Customize the footer, header and sidebar section",
            "Update image in message to initials"
          ]
        },
        {
          "version": "1.0.0",
          "list": [
            "Users can submit messages without signing in.",
            "If no username is provided, a default name like anonym-message#<random> is assigned.",
            "All messages are stored indefinitely and visible to everyone.",
            "A maximum of 100 messages is stored at a time.",
            "Messages are automatically deleted if they are 1 year old.",
            "Users can send only one message per hour from the same device.",
            "Each message displays the sender's name, the message and the date in format: Month/DD/YYYY."
          ]
        }
      ],
      "homepage": "https://ryzbook.vercel.app",
      "git": "https://github.com/ryzdevs/ryzbook",
      "license": "MIT",
      "contributors": null
    },
    {
      "id": 22,
      "name": "Palindrome Checker",
      "created_at": "2025-02-16T08:20:20Z",
      "updated_at": "2025-02-16T08:23:39Z",
      "image": null,
      "description": {
        "summary": "Palindrome checker is a web-based application built with HTML, CSS and JavaScript.",
        "detail": [
          "Palindrome Checker is a web-based application built with HTML, CSS and JavaScript. The app allows users to check if a text is a palindrome automatically without the need to press any buttons."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "User simply enter text into the input, and the result will be displayed directly below the input.",
            "No need to click the button to check the palindrome.",
            "Designed to be used comfortably on a variety of devices, both desktop and mobile.",
            "Developed with CSS to provide a clean and modern user experience."
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/palindrome-checker/",
      "git": "https://github.com/ryzmdn/palindrome-checker",
      "license": null,
      "contributors": null
    },
    {
      "id": 23,
      "name": "Text to Speech Converter",
      "created_at": "2025-02-18T14:11:50Z",
      "updated_at": "2025-02-18T14:15:05Z",
      "image": null,
      "description": {
        "summary": "Web-based application that allows users to convert text to speech using JavaScript's built-in API.",
        "detail": [
          "Text to Speech Converter is a web-based application that allows users to convert text to speech using JavaScript's built-in API. Users can choose a variety of sounds, adjust the pitch (pitch), and adjust the speed of the sound.",
          "The MediaRecorder API for recording sound may not work in all browsers."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Enter the text, then listen to the voice directly.",
            "A variety of voice options are available based on the browser's built-in Speech Synthesis API.",
            "Adjust the speed and pitch of the voice according to your preference.",
            "Can be used comfortably on a variety of devices, both desktop and mobile.",
            "Built with only pure HTML, CSS, and JavaScript."
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/text-to-speech-converter/",
      "git": "https://github.com/ryzmdn/text-to-speech-converter",
      "license": null,
      "contributors": null
    },
    {
      "id": 24,
      "name": "Simple Calculator",
      "created_at": "2025-02-19T13:13:31Z",
      "updated_at": "2025-02-19T13:17:16Z",
      "image": null,
      "description": {
        "summary": "Web-based application that allows users to perform basic mathematical calculations.",
        "detail": [
          "The calculator is a web-based application that allows users to perform basic mathematical calculations such as addition, subtraction, multiplication, and division. This app is built using HTML, CSS, and JavaScript without using external libraries."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Supports addition (+), subtraction (-), multiplication (*), division (/) and modulus (%).",
            "Comfortable to use on both desktop and mobile devices.",
            "Simple yet attractive design with intuitive visual effects.",
            "Uses only basic web technologies."
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/simple-calculator/",
      "git": "https://github.com/ryzmdn/simple-calculator",
      "license": null,
      "contributors": null
    },
    {
      "id": 25,
      "name": "Quotes Generator",
      "created_at": "2025-02-23T15:33:09Z",
      "updated_at": "2025-02-23T15:36:36Z",
      "image": null,
      "description": {
        "summary": "@eb-based application that displays quotes randomly.",
        "detail": [
          "Quotes Generator is a web-based application that displays quotes randomly. This app is built using HTML, CSS, JavaScript, and JSON. Users can display a new quote by clicking the Refresh or Next Quote button. Additionally, if a user clicks on an author's name, the app will open a new search tab based on that author's name."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript", "JSON", "Website"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Displays random quotes from an available list.",
            "Click the button to get a new quote.",
            "Click the author's name to search for more information in a new tab.",
            "Can be used on a variety of devices, both desktop and mobile.",
            "Built with simple technology without the need for external libraries."
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/quotes-generator/",
      "git": "https://github.com/ryzmdn/quotes-generator",
      "license": null,
      "contributors": null
    },
    {
      "id": 26,
      "name": "Android Basic",
      "created_at": "2025-02-24T04:02:04Z",
      "updated_at": "2025-02-24T04:11:46Z",
      "image": null,
      "description": {
        "summary": "Basic Android projects from Android Studio.",
        "detail": [
          "This is a repository of basic Android projects from Android Studio titled Creating a Business Card App Using Compose."
        ]
      },
      "category": "Application",
      "tags": ["Kotlin", "Android", "Application"],
      "features": null,
      "homepage": null,
      "git": "https://github.com/ryzmdn/android-basic",
      "license": null,
      "contributors": null
    },
    {
      "id": 27,
      "name": "Todo List",
      "created_at": "2025-02-26T03:18:13Z",
      "updated_at": "2025-02-26T03:20:23Z",
      "image": null,
      "description": {
        "summary": "Web-based application that allows users to add, edit, and delete tasks easily.",
        "detail": [
          "To-Do List is a web-based application that allows users to add, edit, and delete tasks easily. This app is built using HTML, CSS, and JavaScript and supports local storage to save the user's task list."
        ]
      },
      "category": "Front-end",
      "tags": ["HTML", "CSS", "JavaScript"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Press the Enter key to add a new task without needing a button.",
            "Each task has two buttons—one for editing and one for deleting.",
            "Double-click on a task title to edit it instantly.",
            "Task lists are automatically saved in the browser, so they remain even after closing the tab."
          ]
        }
      ],
      "homepage": "https://ryzmdn.github.io/todo-list/",
      "git": "https://github.com/ryzmdn/todo-list",
      "license": null,
      "contributors": null
    },
    {
      "id": 28,
      "name": "Android FAQs",
      "created_at": "2025-02-26T14:58:06Z",
      "updated_at": "2025-02-26T15:12:04Z",
      "image": null,
      "description": {
        "summary": "Basic Android projects from Android Studio.",
        "detail": [
          "Android FAQs is an Android application built using Kotlin and Jetpack Compose. This project is based on an intermediate-level Android Studio tutorial focused on creating layouts with Jetpack Compose.",
          "It provides a simple FAQ (Frequently Asked Questions) interface where users can view commonly asked questions and their answers."
        ]
      },
      "category": "Application",
      "tags": ["Kotlin", "Android", "Application"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Uses modern UI development with Jetpack Compose for a clean and responsive interface.",
            "Users can tap on a question to reveal its answer.",
            "FAQ sections expand and collapse with smooth transitions.",
            "Uses Compose's state management for a seamless user experience."
          ]
        }
      ],
      "homepage": null,
      "git": "https://github.com/ryzmdn/android-faqs",
      "license": null,
      "contributors": null
    },
    {
      "id": 29,
      "name": "Android Scroll Layout",
      "created_at": "2025-02-28T15:43:31Z",
      "updated_at": "2025-02-28T15:58:53Z",
      "image": null,
      "description": {
        "summary": "Android app built using Kotlin and Jetpack Compose.",
        "detail": [
          "Android Scroll Layout is an Android application built using Kotlin and Jetpack Compose. This project is inspired by an intermediate-level Android Studio tutorial from Android Developer Codelabs.",
          "It demonstrates how to create scrollable layouts using Jetpack Compose, providing a smooth and responsive user experience."
        ]
      },
      "category": "Application",
      "tags": ["Kotlin", "Android", "Application"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Utilizes modern UI development with Jetpack Compose for a clean and dynamic interface.",
            "Implements scrollable columns and rows to handle content that exceeds the screen size.",
            "Ensures smooth scrolling transitions for a better user experience.",
            "Leverages Compose's state management to handle dynamic content and UI updates."
          ]
        }
      ],
      "homepage": null,
      "git": "https://github.com/ryzmdn/android-scroll-layout",
      "license": null,
      "contributors": null
    },
    {
      "id": 30,
      "name": "RyzNote",
      "created_at": "2025-03-28T23:36:00Z",
      "updated_at": "2025-04-17T14:56:58Z",
      "image": null,
      "description": {
        "summary": "My personal blog made with Next.js, Tailwind CSS and Wordpress.",
        "detail": [
          "RyzNote is a personal blog built with Next.js, Tailwind CSS, and the WordPress API. It serves as a platform for sharing thoughts, tutorials, and experiences related to web development, technology, and personal growth."
        ]
      },
      "category": "Front-end",
      "tags": ["Next.js", "HTML", "TypeScript", "CSS", "TailwindCSS"],
      "features": [
        {
          "version": "1.0.0",
          "list": [
            "Official Release",
            "Add new page: RSS",
            "Blog reading page display adjustments",
            "Fixed client error issue when searching for posts",
            "Fixed issues when opening certain topics",
            "Transition adjustments",
            "Content visibility adjustments"
          ]
        },
        {
          "version": "0.9.1",
          "list": [
            "Search adjustments",
            "Adjust the distance between badges on the blog reading page",
            "Adjust the color and text in the heading section",
            "Adjust the distance between the suggestion section categories",
            "Fix blogs that cannot be loaded in certain categories",
            "Fix search dialog not closing",
            "Fix error when searching blog"
          ]
        },
        {
          "version": "0.9.0",
          "list": [
            "Filter blog by category",
            "Add topic pages",
            "Suggestion menu adjustments",
            "Update dark and light themes"
          ]
        }
      ],
      "homepage": "https://ryznote/vercel.app",
      "git": "https://github.com/ryzmdn/ryznote",
      "license": "MIT",
      "contributors": null
    }
  ]
}
